Repository: karpinsk/master-helper
Catalog: lib/l10n/intl_*.arb
Languages: kk, pl, ru

source: Add detail
kk: Бөлшекті қосу
pl: Dodaj zamówienie
ru: Добавить деталь

source: Add drawing
kk: Сызбаны қосу
pl: Dodaj rysunek
ru: Добавить чертёж

source: Add new subdetail
kk: Жаңа бөлшек
pl: Dodaj nowy element
ru: Добавить новую поддеталь

source: Add note...
kk: Белгіні қосу...
pl: Dodaj notatkę...
ru: Добавить заметку...

source: Add photo
kk: Фотосуретті қосу
pl: Dodaj zdjęcie
ru: Добавить фото

source: Back
kk: Артқа
pl: Wstecz
ru: Назад

source: Camera
kk: Камера
pl: Kamera
ru: Камера

source: Cancel
kk: Бас тарту
pl: Anuluj
ru: Отмена

source: Color
kk: Түс
pl: Kolor
ru: Цвет

# componentsOfDetail
source: Components of
kk: Бөлшектің компоненттері
pl: Komponenty elementu
ru: Компоненты детали

source: Delete
kk: Жою
pl: Usuń
ru: Удалить

source: Delete confirmation
kk: Жоюды растау
pl: Potwierdzenie usunięcia
ru: Подтверждение удаления

# deleteConfirmationMessage
source: This detail and all it's subdetails will be deleted
kk: Бұл бөлшекті барлық қосалқы бөлшектерімен бірге жойғыңыз келетініне сенімдісіз бе?
pl: Czy na pewno chcesz usunąć ten element wraz ze wszystkimi komponentami podrzędnymi?
ru: Вы уверены, что хотите удалить эту деталь вместе со всеми поддеталями?

source: Delete subdetail {serialNumber}
kk: Қосалқы бөлшекті жою {serialNumber}
pl: Usuń element {serialNumber}
ru: Удалить поддеталь {serialNumber}

# deleteDetail
source: Delete details
kk: Бөлшекті жою
pl: Usuń element
ru: Удалить деталь

# detailColors
source: Detail type colors
kk: Бөлшек күйінің белгіленуі

source: Detail name
kk: Бөлшек атауы
pl: Nazwa elementu
ru: Наименование детали

source: Details
kk: Бөлшектер
pl: Szczegóły
ru: Детали

source: Details list
kk: Бөлшектер тізімі
pl: Lista zamówień
ru: Список деталей

source: Detail type
kk: Бөлшек түрі
ru: Тип детали

source: Drawing
kk: Сызба
pl: Rysunek
ru: Чертёж

# drawingAdded
source: Drawing is successfully added!
kk: Бөлшектің сызбасы сәтті қосылды!
pl: Rysunek elementu został pomyślnie dodany!
ru: Чертёж детали успешно добавлен!

source: Drawing expiration date
kk: Сызбаның жарамдылық мерзімі
pl: Data wygaśnięcia rysunku
ru: Срок годности чертежа

# drawingExpired
source: Drawing is expired
kk: Бөлшектің сызбасының мерзімі өткен. Сызбаны ұзарту қажет
pl: Rysunek elementu wygasł. Należy przedłużyć rysunek
ru: Чертёж детали просрочен. Необходимо продлить чертёж

source: Drawing removed
kk: Сызба жойылды
pl: Rysunek został usunięty
ru: Чертёж удалён

# drawingSoonExpiring
source: До истечения чертежа осталось менее 10 дней
kk: Сызбаның аяқталуына 10 күннен аз уақыт қалды
pl: Do wygaśnięcia rysunku pozostało mniej niż 10 dni

source: Edit
kk: Өңдеу
pl: Edytuj
ru: Редактировать

source: Edit detail
kk: Бөлшекті өңдеу
pl: Edytuj element
ru: Редактировать деталь

source: Enter detail name
kk: Бөлшектің атауын енгізіңіз
pl: Wprowadź nazwę elementu
ru: Введите наименование детали

source: Enter drawing expiration date
kk: Сызбаның жарамдылық мерзімін енгізіңіз
pl: Wprowadź datę wygaśnięcia rysunku
ru: Введите срок годности чертежа

source: Enter order number
kk: Тапсырыс нөмірін енгізіңіз
pl: Wprowadź numer zamówienia
ru: Введите номер заказа

source: Enter subdetail name
kk: Қосалқы бөлшектің атауын енгізіңіз
pl: Wprowadź nazwę elementu podrzędnego
ru: Введите название поддетали

source: Error loading details
kk: Деректерді жүктеу кезінде қате пайда болды
pl: Wystąpił błąd podczas ładowania danych
ru: Возникла ошибка при загрузке данных

source: Gallery
kk: Галерея
pl: Galeria
ru: Галерея

# imageNotAdded
source: Image was not added
kk: Фотосурет қосылмады
pl: Zdjęcie nie zostało dodane
ru: Фото не было добавлено

source: Image not found
kk: Фотосурет табылмады
pl: Zdjęcie nie zostało znalezione
ru: Изображение не найдено

source: Information
kk: Ақпарат
pl: Informacja
ru: Информация

source: No notes
kk: Ескертулер жоқ
pl: Brak notatek
ru: Нет заметок

source: Notes
kk: Ескертулер
pl: Notatki
ru: Заметки

source: OK
kk: ОК

source: Order number
kk: Тапсырыс нөмірі
pl: Numer zamówienia
ru: Номер заказа

source: Photo
kk: Фотосурет
pl: Zdjęcie
ru: Фото

# photoAdded
source: Photo is successfully added!
kk: Бөлшектің фотосуреті сәтті қосылды!
pl: Zdjęcie elementu zostało pomyślnie dodane!
ru: Фото детали успешно добавлено!

source: Photo removed
kk: Фотосурет жойылды
pl: Zdjęcie zostało usunięte
ru: Фото удалено

# removeDrawing
source: Drawing was removed
kk: Сызбаны жою
pl: Usuń rysunek
ru: Чертёж удалён

# removePhoto
source: Photo was removed
kk: Фотосуретті жою
pl: Usuń zdjęcie
ru: Фото удалено

source: Replace drawing
kk: Сызбаны ауыстыру
pl: Zastąp rysunek
ru: Заменить чертёж

source: Replace photo
kk: Фотосуретті ауыстыру
pl: Zastąp zdjęcie
ru: Заменить фото

# requiredFieldsEmpty
source: Required fields for detail or subdetails are not filled
kk: Бөлшек немесе қосалқы бөлшектер үшін міндетті өрістер толтырылмаған
pl: Wymagane pola dla elementu lub jego komponentów nie zostały wypełnione
ru: Обязательные поля для детали или поддеталей не заполнены

source: Save
kk: Сақтау
pl: Zapisz
ru: Сохранить

source: Search by order number
kk: Тапсырыс нөмірі бойынша іздеу
pl: Szukaj po numerze zamówienia
ru: Искать по номеру заказа

source: Settings
kk: Баптау
pl: Ustawienia
ru: Настройки

source: Start typing order number...
kk: Тапсырыс нөмірін енгізуді бастаңыз...
pl: Zacznij wpisywać numer zamówienia...
ru: Начните вводить номер заказа...

# statusInProgress
source: В работе
kk: Жұмыста
pl: W trakcie realizacji

# statusWaiting
source: Ожидание
kk: Күту
pl: Oczekiwanie

# subDetailDrawingAdded
source: Drawing of {serialNumber} is successfully added
kk: Қосалқы бөлшектің сызбасы {serialNumber} сәтті қосылды!
pl: Rysunek elementu podrzędnego {serialNumber} został pomyślnie dodany!
ru: Чертёж поддетали {serialNumber} успешно добавлен!

# subDetailInformation
source: Subdetail {serialNumber} information
kk: Қосалқы бөлшек туралы ақпарат {serialNumber}
pl: Informacje o elemencie podrzędnym {serialNumber}
ru: Информация о поддетали {serialNumber}

# subDetailPhotoAdded
source: Subdetail {serialNumber} photo
kk: Қосалқы бөлшектің фотосуреті {serialNumber} сәтті қосылды!
pl: Zdjęcie elementu podrzędnego {serialNumber} zostało pomyślnie dodane!
ru: Фото поддетали {serialNumber} успешно добавлено!

source: Subdetail {serialNumber}
kk: Қосалқы бөлшек {serialNumber}
pl: Element podrzędny {serialNumber}
ru: Поддеталь {serialNumber}

# techProcess
source: Technological process
kk: Технологиялық үдерісi
pl: Proces technologiczny
ru: Тех.процесс

# subDetailTypeSerialNumber
source: SubDetail {serialNumber} type
ru: Тип поддетали {serialNumber}

source: Type
ru: Тип
